# plan

In [11]:
'''
1. get tables neat using join in pandas. concat stuff
2. consider important variables
    consider them some more
3. load up the regression model
    descend gradients
4. reconsider variables
    refine models
    descend refined gradients
5. make graph
6. present


'''
import pandas as pd
import numpy as np

# 4 CSVs. let's join them

In [12]:
main = pd.read_csv('countries_emissions_mmtons.csv')
gdp = pd.read_csv('countries_gdp_billions.csv')
pop = pd.read_csv('countries_populations_thousands.csv')
corr = pd.read_csv('cpi_main.csv')

In [30]:
main.head()

          country           2015           2016
0     Afghanistan    7.732860644    8.541487914
1         Albania    4.100475029    4.221155175
2         Algeria  144.828490377  138.723247027
3  American Samoa    0.355245915    0.360661844
4          Angola   36.182259864   21.417035574

In [31]:
gdp.head()

          country     2015     2016
0     Afghanistan  57.5893  59.6389
1         Albania  29.8787  30.8758
2         Algeria  536.458  553.624
3  American Samoa      NaN      NaN
4          Angola  181.496  176.813

In [32]:
pop.head()

          country     2015     2016
0     Afghanistan  33736.5  34600.2
1         Albania  2923.35  2927.09
2         Algeria  39871.5  40563.9
3  American Samoa      NaN      NaN
4          Angola  27859.3  28852.9

In [33]:
pop.head()

          country     2015     2016
0     Afghanistan  33736.5  34600.2
1         Albania  2923.35  2927.09
2         Algeria  39871.5  40563.9
3  American Samoa      NaN      NaN
4          Angola  27859.3  28852.9

In [34]:
corr.head()

,Country,ISO3,Region,CPI Score 2018,Rank,Standard error,Number of sources,Upper CI,Lower CI,African Development Bank CPIA,...,Economist Intelligence Unit Country Ratings,Freedom House Nations in Transit Ratings,Global Insight Country Risk Ratings,IMD World Competitiveness Yearbook,PERC Asia Risk Guide,PRS International Country Risk Guide,World Bank CPIA,World Economic Forum EOS,World Justice Project Rule of Law Index,Varieties of Democracy Project
0,Denmark,DNK,WE/EU,88,1,2.63,8,92,84,NaN,...,90.0,NaN,83,97.0,NaN,92.0,NaN,79.0,88.0,78.0
1,New Zealand,NZL,AP,87,2,2.44,8,91,83,NaN,...,90.0,NaN,83,92.0,NaN,93.0,NaN,83.0,82.0,77.0
2,Finland,FIN,WE/EU,85,3,2.74,8,89,81,NaN,...,72.0,NaN,83,93.0,NaN,93.0,NaN,90.0,86.0,76.0
3,Singapore,SGP,AP,85,3,1.98,9,88,82,NaN,...,90.0,NaN,83,90.0,89.0,85.0,NaN,90.0,85.0,78.0
4,Sweden,SWE,WE/EU,85,3,2.02,8,88,82,NaN,...,90.0,NaN,83,81.0,NaN,93.0,NaN,77.0,86.0,78.0

## rename columns

In [13]:
### rename columns
pop = pop.rename(columns={'Unnamed: 0':'country'})
gdp = gdp.rename(columns={'Gross Domestic Product':'country'})
main = main.rename(columns={'Emissions':'country'})

## drop 2015 columns

In [14]:
pop.head()

          country     2015     2016
0     Afghanistan  33736.5  34600.2
1         Albania  2923.35  2927.09
2         Algeria  39871.5  40563.9
3  American Samoa      NaN      NaN
4          Angola  27859.3  28852.9

In [15]:
# pop = pop.drop('2015',axis=1)
gdp = gdp.drop('2015',axis=1)
# # main = main.drop(columns=['2015'])

In [16]:
gdp.head()

          country     2016
0     Afghanistan  59.6389
1         Albania  30.8758
2         Algeria  553.624
3  American Samoa      NaN
4          Angola  176.813

Index(['country', '2015', '2016'], dtype='object')

##  join the dataframes on key=country

In [ ]:
# test join: gdp and pop

In [117]:
# test = gdp.set_index('country').join(pop.set_index('country'))

In [17]:
df_a.merge(df_b, on='mukey', how='left')

NameError: name 'df_a' is not defined

In [18]:
test = gdp.merge(pop, on='country', how='left')

In [19]:
test.head()

          country   2016_x     2015   2016_y
0     Afghanistan  59.6389  33736.5  34600.2
1         Albania  30.8758  2923.35  2927.09
2         Algeria  553.624  39871.5  40563.9
3  American Samoa      NaN      NaN      NaN
4          Angola  176.813  27859.3  28852.9

In [ ]:
'''
interesting. it looks like we'll have to reassign the column names... but that's a little 'do it by hand'.
why don't i just take the original dataframes and rename the columns to something more accurate?
and then just remember that the data is 2016
'''

In [20]:
print(main.columns, '\n', gdp.columns, '\n', pop.columns)
main = main.rename(columns={'2016':'co2_mmt'})
gdp = gdp.rename(columns={'2016':'billions_usd'})
pop = pop.rename(columns={'2016':'thousand'}) # perhaps we can convert this to 'people' with some multiplication later

Index(['country', '2015', '2016'], dtype='object')
 Index(['country', '2016'], dtype='object')
 Index(['country', '2015', '2016'], dtype='object')

In [21]:
print(main.columns, '\n', gdp.columns, '\n', pop.columns)
# nice. let's merge anew

Index(['country', '2015', 'co2_mmt'], dtype='object')
 Index(['country', 'billions_usd'], dtype='object')
 Index(['country', '2015', 'thousand'], dtype='object')

In [22]:
test = gdp.merge(pop, on='country', how='left')

In [23]:
test.head()

          country billions_usd     2015 thousand
0     Afghanistan      59.6389  33736.5  34600.2
1         Albania      30.8758  2923.35  2927.09
2         Algeria      553.624  39871.5  40563.9
3  American Samoa          NaN      NaN      NaN
4          Angola      176.813  27859.3  28852.9

In [61]:
test = test.merge(main, on='country', how='left') # is there a way to mass-merge, i wonder?
# if i've got 100 columns in 100 CSVs, surely there's a method to merge them on the same key column

In [63]:
test.head(10)

       country billions_usd thousand           co2_mmt
0  Afghanistan      59.6389  34600.2       8.541487914
1  Afghanistan      59.6389  34600.2   3.3005920383081
2  Afghanistan      59.6389  34600.2       0.324276157
3  Afghanistan      59.6389  34600.2   4.9166197189708
4      Albania      30.8758  2927.09       4.221155175
5      Albania      30.8758  2927.09  0.24143854109673
6      Albania      30.8758  2927.09       0.083641087
7      Albania      30.8758  2927.09   3.8960755467245
8      Algeria      553.624  40563.9     138.723247027
9      Algeria      553.624  40563.9  0.39625362043311

In [ ]:
'''
oh, this isn't good at all. merging in 'main' gave us three duplicates. let's inspect main.
'''

In [65]:
main.head(8) # no duplicates. something with length mismatch?

               country        co2_mmt
0          Afghanistan    8.541487914
1              Albania    4.221155175
2              Algeria  138.723247027
3       American Samoa    0.360661844
4               Angola   21.417035574
5           Antarctica    0.015266697
6  Antigua and Barbuda    0.741255424
7            Argentina  194.099937985

In [67]:
print(len(gdp),len(pop),len(test),len(main))

230 230 920 923

In [ ]:
# oh my. i'm sure it has something to do with the 'how' specifier in merge

In [68]:
test_2 = gdp.merge(pop,on='country',how='inner')

In [69]:
len(test_2) # that's better.

230

In [70]:
test_2 = test_2.merge(main,on='country',how='inner')

In [71]:
len(test_2) # oh no

920

In [72]:
len(main) # ah, that would explain things

923

In [24]:
'''
i explored the emissions.csv a little more: the first ~230 indexes are emission totals for each country,
but after that it starts listing off categorically - emissions by coal, natural gas, etc.
so we'll just cut off main where we need to
'''
main[228:235]

            country              2015           co2_mmt
228          Zambia       3.746348391       3.622226086
229        Zimbabwe      11.594936326      10.480809616
230   Coal and Coke               NaN               NaN
231     Afghanistan   2.6533027869791   3.3005920383081
232         Albania  0.30889394065761  0.24143854109673
233         Algeria  0.74817035613508  0.39625362043311
234  American Samoa                 0                 -

In [25]:
# we can just slice it neatly off at index 230
main = main[:230]
len(main)

230

In [77]:
# now let's re-merge
test_2 = test_2.merge(main,on='country') # inner is a default, i think

In [78]:
len(test_2) # ?!?!

920

In [26]:
em = main
print(len(em),len(gdp),len(pop))

230 230 230

In [27]:
em_gdp = em.merge(gdp,on='country',how='inner')

em_gdp_pop = em_gdp.merge(pop,on='country',how='inner')

print(len(em_gdp,),len(em_gdp_pop)) # okay, looks like we just had to specify inner anyway.

230 230

In [28]:
em_gdp_pop.head(10) # looking good. let's merge in corruption

,country,2015_x,co2_mmt,billions_usd,2015_y,thousand
0,Afghanistan,7.732860644,8.541487914,59.6389,33736.5,34600.2
1,Albania,4.100475029,4.221155175,30.8758,2923.35,2927.09
2,Algeria,144.828490377,138.723247027,553.624,39871.5,40563.9
3,American Samoa,0.355245915,0.360661844,NaN,NaN,NaN
4,Angola,36.182259864,21.417035574,176.813,27859.3,28852.9
5,Antarctica,0.014342885,0.015266697,NaN,NaN,NaN
6,Antigua and Barbuda,0.735377799,0.741255424,2.07874,99.923,100.96
7,Argentina,200.161807683,194.099937985,799.476,43471.3,43897.88
8,Armenia,5.053134828,5.219801504,23.4467,2916.95,2921.3
9,Aruba,1.243515051,1.264083756,2.55485,104.341,104.76

## merge in the more complex dataframe, corruption index

In [29]:
corr.head(10)

,Country,ISO3,Region,CPI Score 2018,Rank,Standard error,Number of sources,Upper CI,Lower CI,African Development Bank CPIA,...,Economist Intelligence Unit Country Ratings,Freedom House Nations in Transit Ratings,Global Insight Country Risk Ratings,IMD World Competitiveness Yearbook,PERC Asia Risk Guide,PRS International Country Risk Guide,World Bank CPIA,World Economic Forum EOS,World Justice Project Rule of Law Index,Varieties of Democracy Project
0,Denmark,DNK,WE/EU,88,1,2.63,8,92,84,NaN,...,90.0,NaN,83,97.0,NaN,92.0,NaN,79.0,88.0,78.0
1,New Zealand,NZL,AP,87,2,2.44,8,91,83,NaN,...,90.0,NaN,83,92.0,NaN,93.0,NaN,83.0,82.0,77.0
2,Finland,FIN,WE/EU,85,3,2.74,8,89,81,NaN,...,72.0,NaN,83,93.0,NaN,93.0,NaN,90.0,86.0,76.0
3,Singapore,SGP,AP,85,3,1.98,9,88,82,NaN,...,90.0,NaN,83,90.0,89.0,85.0,NaN,90.0,85.0,78.0
4,Sweden,SWE,WE/EU,85,3,2.02,8,88,82,NaN,...,90.0,NaN,83,81.0,NaN,93.0,NaN,77.0,86.0,78.0
5,Switzerland,CHE,WE/EU,85,3,1.57,7,88,82,NaN,...,90.0,NaN,83,88.0,NaN,85.0,NaN,87.0,NaN,77.0
6,Norway,NOR,WE/EU,84,7,2.14,8,88,80,NaN,...,90.0,NaN,83,85.0,NaN,93.0,NaN,75.0,86.0,78.0
7,Netherlands,NLD,WE/EU,82,8,2.30,8,86,78,NaN,...,90.0,NaN,83,89.0,NaN,85.0,NaN,80.0,80.0,77.0
8,Canada,CAN,AME,81,9,2.16,8,85,77,NaN,...,90.0,NaN,71,86.0,NaN,85.0,NaN,79.0,80.0,75.0
9,Luxembourg,LUX,WE/EU,81,9,2.32,7,85,77,NaN,...,72.0,NaN,83,86.0,NaN,85.0,NaN,88.0,NaN,74.0

In [30]:

for c in corr.columns: # let's look at how many columns have all 180 values
    print("\\\\\\\\ %s ////" % c)
    print('    ', corr[c].value_counts().sum())

'''
columns of interest:
ISO3, maybe? Region, definitely. CPI Score and rank, definitely.
Global Insight Country Risk Ratings is the only other full 180, so we'll grab that for another metric. 
more data is better when you're working with 180 observations
'''

\\\\ Country ////
     180
\\\\ ISO3 ////
     180
\\\\ Region ////
     180
\\\\ CPI Score 2018 ////
     180
\\\\ Rank  ////
     180
\\\\ Standard error ////
     180
\\\\ Number of sources ////
     180
\\\\ Upper CI ////
     180
\\\\ Lower CI  ////
     180
\\\\ African Development Bank CPIA ////
     38
\\\\ Bertelsmann Foundation Sustainable Governance Index ////
     41
\\\\ Bertelsmann Foundation Transformation Index ////
     129
\\\\ Economist Intelligence Unit Country Ratings ////
     131
\\\\ Freedom House Nations in Transit Ratings ////
     29
\\\\ Global Insight Country Risk Ratings ////
     180
\\\\ IMD World Competitiveness Yearbook ////
     63
\\\\ PERC Asia Risk Guide ////
     15
\\\\ PRS International Country Risk Guide ////
     140
\\\\ World Bank CPIA ////
     68
\\\\ World Economic Forum EOS ////
     134
\\\\ World Justice Project Rule of Law Index ////
     110
\\\\ Varieties of Democracy Project ////
     172

"\ncolumns of interest:\nISO3, maybe? Region, definitely. CPI Score and rank, definitely.\nGlobal Insight Country Risk Ratings is the only other full 180, so we'll grab that for another metric. \nmore data is better when you're working with 180 observations\n"

In [91]:
# corr[['Country','ISO3','Region','CPI Score 2018','Rank']] # errors

In [31]:
cols = ['Country','ISO3','Region','CPI Score 2018', 'Rank ', 'Global Insight Country Risk Ratings'] # why do we have to put it in a list and then use the list?
# oh well. also, Rank has a trailing space. will rename that.
corr[cols].head()

,Country,ISO3,Region,CPI Score 2018,Rank,Global Insight Country Risk Ratings
0,Denmark,DNK,WE/EU,88,1,83
1,New Zealand,NZL,AP,87,2,83
2,Finland,FIN,WE/EU,85,3,83
3,Singapore,SGP,AP,85,3,83
4,Sweden,SWE,WE/EU,85,3,83

In [32]:
len(main)

230

In [33]:
corruption = corr[cols]
corruption.head()

,Country,ISO3,Region,CPI Score 2018,Rank,Global Insight Country Risk Ratings
0,Denmark,DNK,WE/EU,88,1,83
1,New Zealand,NZL,AP,87,2,83
2,Finland,FIN,WE/EU,85,3,83
3,Singapore,SGP,AP,85,3,83
4,Sweden,SWE,WE/EU,85,3,83

## back to merging

In [34]:
# rename the key column
corruption = corruption.rename(columns={'Country':'country'})
print(corruption.columns)

Index(['country', 'ISO3', 'Region', 'CPI Score 2018', 'Rank ',
       'Global Insight Country Risk Ratings'],
      dtype='object')

In [35]:
final = em_gdp_pop.merge(corruption,on='country',how='inner')

In [36]:
len(final)
'''
length is to be expected. there's 230 "countries" in the world,
but less that are what most people think of as "countries".
this correlates with magnitude of contribution to global CO2 emissions, so that's fine.
'''

'\nlength is to be expected. there\'s 230 "countries" in the world,\nbut less that are what most people think of as "countries".\nthis correlates with magnitude of contribution to global CO2 emissions, so that\'s fine.\n'

In [37]:
len(final)

168

In [38]:
final.head(10)

,country,2015_x,co2_mmt,billions_usd,2015_y,thousand,ISO3,Region,CPI Score 2018,Rank,Global Insight Country Risk Ratings
0,Afghanistan,7.732860644,8.541487914,59.6389,33736.5,34600.2,AFG,AP,16,172,10
1,Albania,4.100475029,4.221155175,30.8758,2923.35,2927.09,ALB,ECA,36,99,35
2,Algeria,144.828490377,138.723247027,553.624,39871.5,40563.9,DZA,MENA,35,105,35
3,Angola,36.182259864,21.417035574,176.813,27859.3,28852.9,AGO,SSA,19,165,22
4,Argentina,200.161807683,194.099937985,799.476,43471.3,43897.88,ARG,AME,40,85,35
5,Armenia,5.053134828,5.219801504,23.4467,2916.95,2921.3,ARM,ECA,35,105,35
6,Australia,403.480935712,411.729208833,1088.903,23862.63,24245.95,AUS,AP,77,13,71
7,Austria,67.588333839,68.101232581,383.118,8657.14,8745.72,AUT,WE/EU,76,14,71
8,Azerbaijan,36.537561775,35.117395893,155.209,9617.48,9713.94,AZE,ECA,25,152,35
9,Bahrain,38.357454232,38.107515472,61.0762,1329.11,1348.41,BHR,MENA,36,99,35

In [39]:
final.columns

Index(['country', '2015_x', 'co2_mmt', 'billions_usd', '2015_y', 'thousand',
       'ISO3', 'Region', 'CPI Score 2018', 'Rank ',
       'Global Insight Country Risk Ratings'],
      dtype='object')

In [40]:
main = final # i like calling it main
'''
let's do a little more data cleaning before uploading to SQL
convert the units, probably. population should be adjusted to actual number, not in thousands.
do the same with GDP... maybe? trillion is a lot of 0s for readability.
let's just make new columns for now and decide which to use in the model later 
'''

"\nlet's do a little more data cleaning before uploading to SQL\nconvert the units, probably. population should be adjusted to actual number, not in thousands.\ndo the same with GDP... maybe? trillion is a lot of 0s for readability.\nlet's just make new columns for now and decide which to use in the model later \n"

## let's clean the population data

In [41]:
main.columns

Index(['country', '2015_x', 'co2_mmt', 'billions_usd', '2015_y', 'thousand',
       'ISO3', 'Region', 'CPI Score 2018', 'Rank ',
       'Global Insight Country Risk Ratings'],
      dtype='object')

In [153]:
# convert pop to individuals, mult *1000
def convert_pop(row):
    return row['thousand'] * 1000

In [209]:
main.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 168 entries, 0 to 167
Data columns (total 10 columns):
country                                168 non-null object
co2_mmt                                168 non-null object
billions_usd                           167 non-null object
thousand                               167 non-null float64
ISO3                                   168 non-null object
Region                                 168 non-null object
CPI Score 2018                         168 non-null int64
Rank                                   168 non-null int64
Global Insight Country Risk Ratings    168 non-null int64
population                             167 non-null float64
dtypes: float64(2), int64(3), object(5)
memory usage: 19.4+ KB

In [190]:
main.head()

,country,co2_mmt,billions_usd,thousand,ISO3,Region,CPI Score 2018,Rank,Global Insight Country Risk Ratings
0,Afghanistan,8.541487914,59.6389,34600.20,AFG,AP,16,172,10
1,Albania,4.221155175,30.8758,2927.09,ALB,ECA,36,99,35
2,Algeria,138.723247027,553.624,40563.90,DZA,MENA,35,105,35
3,Angola,21.417035574,176.813,28852.90,AGO,SSA,19,165,22
4,Argentina,194.099937985,799.476,43897.88,ARG,AME,40,85,35

In [183]:
# oh, they're... they're not floats. 'thousand' is a non-null object. my, my.
# let's convert the dtype
main['thousand'][:5]

0    34600.20
1     2927.09
2    40563.90
3    28852.90
4    43897.88
Name: thousand, dtype: float64

In [161]:
def val_float(row):
    return float(row['thousand'])

## back in time: define one method for each column

In [42]:
def fix_pop(row):
    return round(float(row.thousand) , 4) * 1000
def fix_gdp(row):
    return round( float(row.billions_usd), 8) * 1000000000
def fix_co2(row):
    return round( float(row.co2_mmt), 12) * 1000000
def co2_mmt_to_float(row):
    return round(float(row.co2_mmt),12)

In [234]:
test2 = main

In [43]:
main['co2_mmt']= main.apply(lambda row: co2_mmt_to_float(row), axis=1)

In [44]:
main.head()

,country,2015_x,co2_mmt,billions_usd,2015_y,thousand,ISO3,Region,CPI Score 2018,Rank,Global Insight Country Risk Ratings
0,Afghanistan,7.732860644,8.541488,59.6389,33736.5,34600.2,AFG,AP,16,172,10
1,Albania,4.100475029,4.221155,30.8758,2923.35,2927.09,ALB,ECA,36,99,35
2,Algeria,144.828490377,138.723247,553.624,39871.5,40563.9,DZA,MENA,35,105,35
3,Angola,36.182259864,21.417036,176.813,27859.3,28852.9,AGO,SSA,19,165,22
4,Argentina,200.161807683,194.099938,799.476,43471.3,43897.88,ARG,AME,40,85,35

In [45]:
main['population'] = main.apply(lambda row: fix_pop(row), axis=1)
# lambda functions really don't play nice unless you define a helper function, it seems
main['gdp_usd'] = main.apply(lambda row: fix_gdp(row), axis=1)
# CO2 in metric tonnes! don't forget! i didn't want to write that out in the variable name.
main['co2_mt'] = main.apply(lambda row: fix_co2(row),axis=1)

In [46]:
main.head()

,country,2015_x,co2_mmt,billions_usd,2015_y,thousand,ISO3,Region,CPI Score 2018,Rank,Global Insight Country Risk Ratings,population,gdp_usd,co2_mt
0,Afghanistan,7.732860644,8.541488,59.6389,33736.5,34600.2,AFG,AP,16,172,10,34600200.0,5.963890e+10,8.541488e+06
1,Albania,4.100475029,4.221155,30.8758,2923.35,2927.09,ALB,ECA,36,99,35,2927090.0,3.087580e+10,4.221155e+06
2,Algeria,144.828490377,138.723247,553.624,39871.5,40563.9,DZA,MENA,35,105,35,40563900.0,5.536240e+11,1.387232e+08
3,Angola,36.182259864,21.417036,176.813,27859.3,28852.9,AGO,SSA,19,165,22,28852900.0,1.768130e+11,2.141704e+07
4,Argentina,200.161807683,194.099938,799.476,43471.3,43897.88,ARG,AME,40,85,35,43897880.0,7.994760e+11,1.940999e+08

In [47]:
# main.apply(lambda row: convert_pop(row), axis=1)
# we have nulls in pop. let's check the null pop countries
main[main['thousand'].isna()] # it's just south sudan. we don't need that.

,country,2015_x,co2_mmt,billions_usd,2015_y,thousand,ISO3,Region,CPI Score 2018,Rank,Global Insight Country Risk Ratings,population,gdp_usd,co2_mt
137,South Sudan,1.090730778,1.222082,NaN,NaN,NaN,SSD,SSA,13,178,10,NaN,NaN,1222081.906

In [ ]:
main.drop()

In [220]:
test = main # save a copy before dropping

In [48]:
main = main.drop(main[main.thousand.isna()].index) # why is this .index?
# farewell, south sudan

In [49]:
main.isna().any()

country                                False
2015_x                                 False
co2_mmt                                False
billions_usd                           False
2015_y                                 False
thousand                               False
ISO3                                   False
Region                                 False
CPI Score 2018                         False
Rank                                   False
Global Insight Country Risk Ratings    False
population                             False
gdp_usd                                False
co2_mt                                 False
dtype: bool

In [10]:
main.head()

NameError: name 'main' is not defined

In [237]:
main.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 167 entries, 0 to 167
Data columns (total 12 columns):
country                                167 non-null object
co2_mmt                                167 non-null float64
billions_usd                           167 non-null object
thousand                               167 non-null float64
ISO3                                   167 non-null object
Region                                 167 non-null object
CPI Score 2018                         167 non-null int64
Rank                                   167 non-null int64
Global Insight Country Risk Ratings    167 non-null int64
population                             167 non-null float64
gdp_usd                                167 non-null float64
co2_mt                                 167 non-null float64
dtypes: float64(5), int64(3), object(4)
memory usage: 17.0+ KB

# data is clean! time to put into SQL

In [50]:
import config # don't hardcode passwords
import mysql.connector

In [93]:
database_cnx = mysql.connector.connect(
    host = config.host,
    user = config.user,
    passwd = config.passwd,
    database = config.DB_NAME
)
database_cursor = database_cnx.cursor(buffered=True)
print(database_cursor)

CMySQLCursorBuffered: (Nothing executed yet)

In [88]:
# database_cursor.close()
# database_cnx.close()

In [ ]:
'''
df.to_sql(con=con, name='table_name_for_df', if_exists='replace', flavor='mysql')

'''

In [52]:
main.columns

Index(['country', '2015_x', 'co2_mmt', 'billions_usd', '2015_y', 'thousand',
       'ISO3', 'Region', 'CPI Score 2018', 'Rank ',
       'Global Insight Country Risk Ratings', 'population', 'gdp_usd',
       'co2_mt'],
      dtype='object')

In [54]:
main.head(5)

,country,2015_x,co2_mmt,billions_usd,2015_y,thousand,ISO3,Region,CPI Score 2018,Rank,Global Insight Country Risk Ratings,population,gdp_usd,co2_mt
0,Afghanistan,7.732860644,8.541488,59.6389,33736.5,34600.2,AFG,AP,16,172,10,34600200.0,5.963890e+10,8.541488e+06
1,Albania,4.100475029,4.221155,30.8758,2923.35,2927.09,ALB,ECA,36,99,35,2927090.0,3.087580e+10,4.221155e+06
2,Algeria,144.828490377,138.723247,553.624,39871.5,40563.9,DZA,MENA,35,105,35,40563900.0,5.536240e+11,1.387232e+08
3,Angola,36.182259864,21.417036,176.813,27859.3,28852.9,AGO,SSA,19,165,22,28852900.0,1.768130e+11,2.141704e+07
4,Argentina,200.161807683,194.099938,799.476,43471.3,43897.88,ARG,AME,40,85,35,43897880.0,7.994760e+11,1.940999e+08

In [61]:
def tuplify(df):
    tup_list = []
    
    for index, row in df.iterrows():
        tup = (row['country'], 
               row['gdp_usd'], 
               row['population'], 
               row['CPI Score 2018'], 
               row['Rank '],
               row['Global Insight Country Risk Ratings'],
               row['co2_mmt']
              ) # tuple length 7
        tup_list.append(tup)
    return tup_list

In [62]:
tuptest = tuplify(main)

In [64]:
tuptest[:10]

[('Afghanistan', 59638900000.0, 34600200.0, 16, 172, 10, 8.541487914),
 ('Albania', 30875800000.0, 2927090.0, 36, 99, 35, 4.221155175),
 ('Algeria', 553624000000.0, 40563900.0, 35, 105, 35, 138.723247027),
 ('Angola', 176813000000.0, 28852900.0, 19, 165, 22, 21.417035574),
 ('Argentina', 799476000000.0, 43897880.0, 40, 85, 35, 194.099937985),
 ('Armenia', 23446700000.0, 2921300.0, 35, 105, 35, 5.219801504),
 ('Australia', 1088903000000.0, 24245950.0, 77, 13, 71, 411.729208833),
 ('Austria', 383118000000.0, 8745720.0, 76, 14, 71, 68.101232581),
 ('Azerbaijan', 155209000000.0, 9713940.0, 25, 152, 35, 35.117395893),
 ('Bahrain', 61076200000.0, 1348410.0, 36, 99, 35, 38.107515472)]

In [89]:
tuptest

[('Afghanistan', 59638900000.0, 34600200.0, 16, 172, 10, 8.541487914),
 ('Albania', 30875800000.0, 2927090.0, 36, 99, 35, 4.221155175),
 ('Algeria', 553624000000.0, 40563900.0, 35, 105, 35, 138.723247027),
 ('Angola', 176813000000.0, 28852900.0, 19, 165, 22, 21.417035574),
 ('Argentina', 799476000000.0, 43897880.0, 40, 85, 35, 194.099937985),
 ('Armenia', 23446700000.0, 2921300.0, 35, 105, 35, 5.219801504),
 ('Australia', 1088903000000.0, 24245950.0, 77, 13, 71, 411.729208833),
 ('Austria', 383118000000.0, 8745720.0, 76, 14, 71, 68.101232581),
 ('Azerbaijan', 155209000000.0, 9713940.0, 25, 152, 35, 35.117395893),
 ('Bahrain', 61076200000.0, 1348410.0, 36, 99, 35, 38.107515472),
 ('Bangladesh', 569985000000.0, 162916000.0, 26, 149, 22, 79.204847853),
 ('Barbados', 4731870000.0, 284887.0, 68, 25, 71, 1.756547847),
 ('Belarus', 155762000000.0, 9471700.0, 44, 70, 47, 55.443035917),
 ('Belgium', 464710000000.0, 11336500.0, 75, 17, 71, 137.63927863),
 ('Benin', 21403300000.0, 10885400.0, 40, 85, 35, 5.435664469),
 ('Bhutan', 5877710000.0, 796958.0, 68, 25, 71, 0.580460273),
 ('Bolivia', 71531400000.0, 10888600.0, 29, 132, 35, 17.994768699),
 ('Bosnia and Herzegovina',
  39560500000.0,
  3528410.0,
  38,
  89,
  35,
  18.566236465),
 ('Botswana', 33933799999.999996, 2250510.0, 61, 34, 59, 5.783427676),
 ('Brazil', 2870234000000.0, 207851500.0, 35, 105, 35, 492.541110608),
 ('Bulgaria', 132050800000.00002, 7121330.0, 42, 77, 35, 42.888054364),
 ('Burkina Faso', 29994700000.0, 18669200.0, 41, 78, 47, 3.41814636),
 ('Burundi', 7130170000.0, 10547300.0, 17, 170, 22, 0.217061455),
 ('Cambodia', 53465400000.0, 15757200.0, 20, 161, 22, 9.649779581),
 ('Cameroon', 76987300000.0, 23459200.0, 25, 152, 35, 7.111220607),
 ('Canada', 1521620000000.0, 36051750.0, 81, 9, 71, 633.395053164),
 ('Central African Republic',
  2824990000.0,
  4621060.0,
  26,
  149,
  22,
  0.414600677),
 ('Chad', 26306200000.0, 14464500.0, 19, 165, 22, 0.342686906),
 ('Chile', 396449300000.0, 17928050.0, 67, 27, 59, 83.509779709),
 ('China', 19400000000000.0, 1404132000.0, 39, 87, 47, 10592.824304791),
 ('Colombia', 623204000000.0, 48627000.0, 36, 99, 47, 87.705481916),
 ('Comoros', 1149000000.0, 795859.0, 27, 144, 47, 0.193975049),
 ('Costa Rica', 72358900000.0, 4855120.0, 56, 48, 47, 7.650266452),
 ('Croatia', 88538700000.0, 4167885.0, 48, 60, 47, 17.061577051),
 ('Cuba', 130110999999.99998, 11468200.0, 47, 61, 47, 24.683271777),
 ('Cyprus', 27741900000.0, 854802.0, 59, 38, 59, 8.146004013),
 ('Czech Republic', 321115000000.0, 10569450.0, 59, 38, 71, 106.274711249),
 ('Denmark', 253474500000.0, 5733200.0, 88, 1, 83, 37.763337624),
 ('Djibouti', 3037470000.0, 941911.0, 31, 124, 47, 0.951511327),
 ('Dominica', 734646000.0, 73543.0, 57, 45, 59, 0.199179831),
 ('Dominican Republic', 147299000000.0, 10644400.0, 30, 129, 35, 23.322056815),
 ('Ecuador', 167902000000.0, 16382600.0, 34, 114, 22, 36.820012224),
 ('Egypt', 1030010000000.0, 95610800.0, 35, 105, 35, 229.443277691),
 ('El Salvador', 44525200000.0, 6345790.0, 35, 105, 35, 7.317998832),
 ('Equatorial Guinea', 28910200000.0, 1221570.0, 16, 172, 10, 3.063546476),
 ('Eritrea', 8343159999.999999, 4964020.0, 24, 157, 35, 0.493125459),
 ('Estonia', 35961100000.0, 1315640.0, 73, 18, 71, 5.269093721),
 ('Ethiopia', 163867000000.0, 102450000.0, 34, 114, 35, 12.025834203),
 ('Finland', 213514400000.0, 5497303.0, 85, 3, 83, 46.606433768),
 ('France', 2487650000000.0, 66892100.00000001, 72, 21, 71, 354.098788532),
 ('Gabon', 32497900000.0, 1974400.0, 31, 124, 35, 3.980412397),
 ('Georgia', 35487600000.0, 3940930.0, 58, 41, 47, 10.353839745),
 ('Germany', 3649314000000.0, 82391950.0, 80, 11, 83, 826.40216239),
 ('Ghana', 106867000000.0, 28213000.0, 41, 78, 35, 13.435526878),
 ('Greece', 262439900000.00003, 10774050.0, 45, 67, 47, 68.23888029),
 ('Grenada', 1357040000.0, 107320.0, 52, 53, 47, 0.284113686),
 ('Guatemala', 119582000000.0, 16584099.999999998, 27, 144, 22, 16.725585241),
 ('Guinea', 23002100000.0, 12423400.0, 28, 138, 35, 2.797768695),
 ('Guyana', 5494550000.0, 772968.0, 37, 93, 35, 2.134799821),
 ('Haiti', 17572800000.0, 10843100.0, 20, 161, 22, 3.41103099),
 ('Honduras', 39336500000.0, 9112520.0, 29, 132, 22, 9.289176544),
 ('Hong Kong', 391375800000.0, 7309973.0, 76, 14, 83, 98.323982108),
 ('Hungary', 248449900000.0, 9809904.0, 46, 64, 59, 49.489057608),
 ('Iceland', 15568300000.0, 332840.0, 76, 14, 83, 3.232656815),
 ('India', 7962030000000.0, 1326108000.0, 41, 78, 47, 2154.761606057),
 ('Indonesia', 2754647000000.0, 261461000.0, 38, 89, 47, 513.149340009),
 ('Iran', 1441910000000.0, 80205800.0, 28, 138, 35, 638.538597076),
 ('Iraq', 693340000000.0, 37202600.0, 18, 168, 10, 120.477589725),
 ('Ireland', 293455200000.0, 4762595.0, 73, 18, 71, 37.509782543),
 ('Israel', 275424000000.0, 8194350.0, 61, 34, 59, 70.44220342),
 ('Italy', 2039774000000.0, 60617980.0, 52, 53, 59, 356.121837269),
 ('Jamaica', 23165100000.0, 2880180.0, 44, 70, 35, 8.765132358),
 ('Japan', 4740050000000.0, 127716000.0, 73, 18, 71, 1202.518879939),
 ('Jordan', 77707300000.0, 9369170.0, 49, 58, 35, 24.532098903),
 ('Kazakhstan', 408057000000.0, 17955200.0, 31, 124, 35, 279.282873451),
 ('Kenya', 138918000000.0, 48487400.0, 27, 144, 22, 17.886577262),
 ('Kosovo', 16821800000.0, 1999790.0, 37, 93, 35, 8.938085521),
 ('Kuwait', 268528000000.00003, 4009210.0, 41, 78, 35, 98.364696299),
 ('Kyrgyzstan', 19833400000.0, 5952670.0, 29, 132, 22, 9.66658844),
 ('Laos', 41201300000.0, 6764140.0, 29, 132, 35, 9.397113068),
 ('Latvia', 45772200000.0, 1950120.0, 58, 41, 59, 8.417974012),
 ('Lebanon', 78065500000.0, 5885140.0, 28, 138, 22, 23.260003236),
 ('Lesotho', 6204920000.0, 2204160.0, 41, 78, 59, 0.712526059),
 ('Liberia', 5308960000.0, 4620470.0, 32, 120, 22, 1.164526405),
 ('Libya', 53032400000.0, 6320400.0, 17, 170, 10, 42.640300803),
 ('Lithuania', 78404100000.0, 2847900.0, 59, 38, 59, 13.969520031),
 ('Luxembourg', 53497500000.0, 580210.0, 81, 9, 83, 10.19624216),
 ('Macedonia', 27605300000.0, 2081050.0000000002, 37, 93, 35, 6.895169399),
 ('Madagascar', 33506800000.0, 24925400.0, 25, 152, 35, 3.840009212),
 ('Malawi', 19205900000.0, 18115600.0, 32, 120, 47, 1.054027657),
 ('Malaysia', 784953000000.0, 31237900.0, 47, 61, 47, 215.715583328),
 ('Maldives', 5970570000.0, 364000.0, 31, 124, 35, 1.651954283),
 ('Mali', 44354500000.0, 18031200.0, 32, 120, 35, 3.387335965),
 ('Malta', 16363000000.0, 460297.0, 54, 51, 59, 7.821644664),
 ('Mauritania', 15050300000.0, 4302630.0, 27, 144, 35, 2.619433268),
 ('Mauritius', 24246200000.0, 1262390.0, 51, 56, 59, 6.027392653),
 ('Mexico', 2145034999999.9998, 127740000.0, 28, 138, 22, 452.580730959),
 ('Moldova', 20239900000.0, 3553100.0, 33, 117, 47, 7.607940909),
 ('Mongolia', 33944699999.999996, 3023380.0, 37, 93, 47, 16.779087674),
 ('Montenegro', 9459120000.0, 628422.0, 45, 67, 47, 2.217694446),
 ('Morocco', 255334000000.0, 35256800.0, 43, 73, 35, 52.882469182),
 ('Mozambique', 31836300000.0, 28870400.0, 23, 158, 22, 9.664523806),
 ('Myanmar', 274870000000.0, 52884600.0, 29, 132, 22, 27.006455292),
 ('Namibia', 23848200000.0, 2479760.0, 53, 52, 59, 3.854314456),
 ('Nepal', 66244500000.0, 28977100.0, 31, 124, 35, 6.182924994),
 ('Netherlands', 800064000000.0, 17043100.0, 82, 8, 83, 248.652380687),
 ('New Zealand', 163069000000.0, 4659575.0, 87, 2, 83, 37.511750471),
 ('Nicaragua', 30907500000.0, 6148940.0, 25, 152, 22, 5.397170442),
 ('Niger', 18585200000.0, 20732500.0, 34, 114, 35, 2.248720223),
 ('Nigeria', 990122000000.0, 186176000.0, 27, 144, 22, 97.103695823),
 ('Norway', 332519900000.0, 5240470.0, 84, 7, 83, 43.238736148),
 ('Oman', 166236000000.0, 4389790.0, 52, 53, 47, 68.45755233),
 ('Pakistan', 896298000000.0, 193177000.0, 33, 117, 35, 175.70651572),
 ('Panama', 83118400000.0, 4033260.0, 37, 93, 35, 25.458451562),
 ('Papua New Guinea', 25287200000.0, 8087000.0, 28, 138, 22, 6.097005088),
 ('Paraguay', 75552100000.0, 6724560.0, 29, 132, 22, 7.20870691),
 ('Peru', 373980000000.0, 31763800.0, 35, 105, 35, 55.017240495),
 ('Philippines', 732704000000.0, 103514500.0, 36, 99, 35, 110.741520498),
 ('Poland', 957418000000.0, 37970800.0, 60, 36, 59, 307.402241626),
 ('Portugal', 273194300000.0, 10321500.0, 64, 30, 59, 55.198158034),
 ('Qatar', 297335000000.0, 2543590.0, 62, 33, 47, 102.483600023),
 ('Romania', 405076700000.0, 19687800.0, 47, 61, 47, 71.676642042),
 ('Russia', 3491709000000.0, 143942000.0, 28, 138, 22, 1766.611721141),
 ('Rwanda', 20705200000.0, 11921100.0, 56, 48, 59, 0.987122598),
 ('Saint Lucia', 2094850000.0, 178005.0, 55, 50, 47, 0.438496858),
 ('Sao Tome and Principe', 587902000.0, 200045.0, 46, 64, 47, 0.148414412),
 ('Saudi Arabia', 1593750000000.0, 32187600.0, 49, 58, 22, 656.578258322),
 ('Senegal', 44811700000.0, 15421600.0, 45, 67, 47, 8.603164366),
 ('Serbia', 95269800000.0, 7058320.0, 39, 87, 35, 47.510254604),
 ('Seychelles', 2259570000.0, 94216.0, 66, 28, 71, 1.152034507),
 ('Sierra Leone', 9885780000.0, 7399010.0, 30, 129, 35, 0.986173422),
 ('Singapore', 458821000000.0, 5607282.0, 85, 3, 83, 255.184950075),
 ('Slovakia', 154954900000.0, 5431933.0, 50, 57, 59, 33.500725783),
 ('Slovenia', 60470400000.0, 2065900.0, 60, 36, 71, 13.594457139),
 ('Solomon Islands', 1043290000.0, 599445.0, 44, 70, 59, 0.233857761),
 ('Somalia', 6877670000.0, 14347500.0, 10, 180, 22, 0.850896626),
 ('South Africa', 672566000000.0, 56088650.0, 43, 73, 47, 510.751502614),
 ('Spain', 1537468000000.0, 46495050.0, 58, 41, 47, 286.124055964),
 ('Sri Lanka', 237770000000.0, 20788000.0, 38, 89, 35, 24.262210492),
 ('Sudan', 198875000000.0, 39626500.0, 16, 172, 22, 18.948834793),
 ('Suriname', 7592770000.0, 558117.0, 43, 73, 35, 2.058325291),
 ('Swaziland', 10347200000.0, 1343070.0, 38, 89, 35, 1.089523758),
 ('Sweden', 451782000000.0, 9941100.0, 85, 3, 83, 53.407685513),
 ('Switzerland', 457510000000.0, 8419550.0, 85, 3, 83, 39.75981297),
 ('Syria', 68489000000.00001, 18772900.0, 13, 178, 10, 28.227673558),
 ('Taiwan', 1029931000000.0, 23522000.0, 63, 31, 71, 326.276700357),
 ('Tajikistan', 22544700000.0, 8733970.0, 25, 152, 22, 5.440524346),
 ('Tanzania', 136526000000.00002, 55658900.0, 36, 99, 35, 14.473595189),
 ('Thailand', 1060967000000.0001, 68882500.0, 36, 99, 35, 342.33855183),
 ('Timor-Leste', 6861370000.0, 1269060.0, 35, 105, 35, 0.531910064),
 ('Togo', 11054100000.0, 7610300.0, 30, 129, 35, 2.58506354),
 ('Trinidad and Tobago', 41232700000.0, 1363620.0, 41, 78, 35, 49.319426481),
 ('Tunisia', 120206000000.0, 11399600.0, 43, 73, 47, 22.869615584),
 ('Turkey', 1815585000000.0, 79615100.0, 41, 78, 47, 366.083909186),
 ('Turkmenistan', 86782000000.0, 5658470.0, 20, 161, 22, 98.959239476),
 ('Uganda', 75998600000.0, 41553400.0, 26, 149, 22, 4.710814265),
 ('Ukraine', 320937000000.0, 42800000.0, 32, 120, 35, 223.956971721),
 ('United Arab Emirates',
  614766000000.0,
  9286080.0,
  70,
  23,
  47,
  288.875809304),
 ('United Kingdom',
  2561884000000.0,
  65687880.00000001,
  80,
  11,
  71,
  480.680495215),
 ('Uruguay', 67787000000.00001, 3444120.0, 70, 23, 59, 7.519395113),
 ('Uzbekistan', 188391000000.0, 31428000.0, 23, 158, 22, 92.948991239),
 ('Vanuatu', 672159000.0, 270469.0, 46, 64, 47, 0.164924114),
 ('Venezuela', 428020000000.0, 31568170.0, 18, 168, 10, 130.15461283),
 ('Vietnam', 540764000000.0, 94529300.0, 33, 117, 35, 218.766587958),
 ('Yemen', 50849800000.0, 27582000.0, 14, 176, 10, 8.887855262),
 ('Zambia', 59353400000.0, 16616300.0, 35, 105, 35, 3.622226086),
 ('Zimbabwe', 29444000000.0, 16158000.0, 22, 160, 22, 10.480809616)]

In [ ]:
TABLES['employees'] = (
    "CREATE TABLE employees ("
    "  emp_no int(11) NOT NULL AUTO_INCREMENT,"
    "  birth_date date NOT NULL,"
    "  first_name varchar(14) NOT NULL,"
    "  last_name varchar(16) NOT NULL,"
    "  gender enum('M','F') NOT NULL,"
    "  hire_date date NOT NULL,"
    "  PRIMARY KEY (emp_no)"
    ") ENGINE=InnoDB")

In [96]:
TABLES = {} # some old code
TABLES['final'] = (
    "CREATE TABLE final ("
    "  country varchar(100) NOT NULL,"
    "  gdp_usd FLOAT NOT NULL,"
    "  population FLOAT NOT NULL,"
    "  CPI int(4) NOT NULL,"
    "  rank int(4) NOT NULL,"
    "  GI_risk int(4) NOT NULL,"
    "  co2_mmt FLOAT NOT NULL,"
    "  PRIMARY KEY ( country)"
    ") ENGINE=InnoDB")

In [81]:
/// tuple
    for index, row in df.iterrows():
        tup = (row['country'], 
               row['gdp_usd'], 
               row['population'], 
               row['CPI Score 2018'], 
               row['Rank '],
               row['Global Insight Country Risk Ratings'],
               row['co2_mmt']
///

In [99]:
# data = [
#   ('Jane', date(2005, 2, 12)),
#   ('Joe', date(2006, 5, 23)),
#   ('John', date(2010, 10, 3)),
# ]
data = tuptest
stmt = '''INSERT INTO final (country, gdp_usd, population, CPI, rank, GI_risk, co2_mmt)
        VALUES (%s, %s, %s, %s, %s, %s, %s)'''
# odd that you just use %s and pass it a list of tuples. i suppose that's just how it works

database_cursor.executemany(stmt, data)
database_cnx.commit()
print('yeah')

yeah

In [97]:
create_query = TABLES['final']
def create_table(query):
    database_cursor.execute(query)
    database_cnx.commit()
    print('created table successfully.')

In [98]:
create_table(create_query)

created table successfully.

# Table created, data inserted.

In [ ]:
'''
||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
'''

## Interlude: pull the SQL table into a dataframe again

## Now:

### pull Kyle's data into a dataframe, and see what we can get to merging